import { Link } from "react-router-dom";
import "./footer.scss";

function Footer() {
  return (
    <footer>
      <div className="footerTop">
        <Link to="">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512">
            <path d="M224.1 141c-63.6 0-114.9 51.3-114.9 114.9s51.3 114.9 114.9 114.9S339 319.5 339 255.9 287.7 141 224.1 141zm0 189.6c-41.1 0-74.7-33.5-74.7-74.7s33.5-74.7 74.7-74.7 74.7 33.5 74.7 74.7-33.6 74.7-74.7 74.7zm146.4-194.3c0 14.9-12 26.8-26.8 26.8-14.9 0-26.8-12-26.8-26.8s12-26.8 26.8-26.8 26.8 12 26.8 26.8zm76.1 27.2c-1.7-35.9-9.9-67.7-36.2-93.9-26.2-26.2-58-34.4-93.9-36.2-37-2.1-147.9-2.1-184.9 0-35.8 1.7-67.6 9.9-93.9 36.1s-34.4 58-36.2 93.9c-2.1 37-2.1 147.9 0 184.9 1.7 35.9 9.9 67.7 36.2 93.9s58 34.4 93.9 36.2c37 2.1 147.9 2.1 184.9 0 35.9-1.7 67.7-9.9 93.9-36.2 26.2-26.2 34.4-58 36.2-93.9 2.1-37 2.1-147.8 0-184.8zM398.8 388c-7.8 19.6-22.9 34.7-42.6 42.6-29.5 11.7-99.5 9-132.1 9s-102.7 2.6-132.1-9c-19.6-7.8-34.7-22.9-42.6-42.6-11.7-29.5-9-99.5-9-132.1s-2.6-102.7 9-132.1c7.8-19.6 22.9-34.7 42.6-42.6 29.5-11.7 99.5-9 132.1-9s102.7-2.6 132.1 9c19.6 7.8 34.7 22.9 42.6 42.6 11.7 29.5 9 99.5 9 132.1s2.7 102.7-9 132.1z" />
          </svg>
        </Link>

        <h4>Sometimes you win, Sometimes you learn.</h4>

        <p>
          향은 보이지도, 답히지도 않지만, 우리에게 수많은 기억과 감정을
          각인시키고, 나아가 우리 삶 속에서 많은 부분을 결정합니다. 그랑핸드는
          이러한 향의 가치를 믿으며, 이를 매개로 한 끊임없는 기도를 통해 향의
          일상화를 꿈꿉니다. 그랑핸드는 쉽게 소비되고 잊혀질 무선가가 아닌,
          보이지 않는 곳에서 뚜렷한 존재감으로 모든 사람들에게 우리의 마음과
          온기를 전하고 싶습니다.
        </p>
      </div>

      <div className="info">
        <p>대표 정준혁</p>
        <p>상호 (유)그랑핸드</p>
        <p>사업자번호 127-88-888898</p>
        <p>통신판매업 2020-서울종로- 0600</p>
        <p>주소 서울시 종로구 지하문로4길 14-2</p>
        <p>메일 hello@granhand.com</p>
        <p>전화 02-333-6666</p>
        <p>이용약관 개인정보관리책임자 정유진</p>
        <p>개인정보처리방침 호스팅 (주)아이웹</p>
      </div>
    </footer>
  );
}

export default Footer;
